ErpTest/src/Documents/пкОперацииСПультами/пкОперацииСПультами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пкОперацииСПультами</name>
  <basedOn>Document.пкДоставка</basedOn>
  <registerRecords>InformationRegister.пкМестонахожденияПультовДляПодъемников</registerRecords>
  <attributes>
    <name>ВидОперацииВТабличнойЧасти</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.пкВидыОперацийСПультами</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.пкДоставка</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеПоПультам</name>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>EnumRef.пкВидыОперацийСПультами</types>
      </type>
    </attributes>
    <attributes>
      <name>Пульт</name>
      <type>
        <types>CatalogRef.пкПультыДляПодъемников</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.СкладскиеЯчейки</types>
        <types>CatalogRef.СМ_ОбъектыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектЭксплуатацииВозврат</name>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектСтроительстваВозврат</name>
      <type>
        <types>CatalogRef.СМ_ОбъектыСтроительства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/InformationRegisters/пкМестонахожденияПультовДляПодъемников/пкМестонахожденияПультовДляПодъемников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкМестонахожденияПультовДляПодъемников</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.пкСтатусСостоянияПульта</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <resources>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СкладскиеЯчейки</types>
      <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    </type>
  </resources>
  <dimensions>
    <name>Пульт</name>
    <type>
      <types>CatalogRef.пкПультыДляПодъемников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Enums/пкВидыОперацийЗаданийНаПеревозку/пкВидыОперацийЗаданийНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкВидыОперацийЗаданийНаПеревозку</name>
  <enumValues>
    <name>ДоставкаКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>Перекат</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеМеждуРегионами</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Enums/пкВидыОперацийСПультами/пкВидыОперацийСПультами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкВидыОперацийСПультами</name>
  <enumValues>
    <name>Поступление</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>ПередачаКонтрагенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтКонтрагента</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееПеремещение</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Documents/пкДоставка/пкДоставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пкДоставка</name>
  <comment>Доставка техники</comment>
  <registerRecords>AccumulationRegister.пкМоделиКДоставкеПоЗаявкамНаАрендуТехники</registerRecords>
  <registerRecords>AccumulationRegister.пкТехникаКПеремещениюМеждуРегионами</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоРейсаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоРейсаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеРейсаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеРейсаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.пкСтатусыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкуВыполняет</name>
    <type>
      <types>EnumRef.ТипыИсполнителейЗаданийНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействияДовернности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействияДовернности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Партнеры</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный за доставку</comment>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентЗагрузкиТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Д_Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Д_Документ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Д_ВодительПодпись</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаданияНаПеревозку</name>
    <attributes>
      <name>НомерХодки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаМаршрута</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаданиеНаПеревозку</name>
      <type>
        <types>DocumentRef.пкЗаданиеНаПеревозку</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемоеВремяДоставки</name>
      <comment>Время, когда планируется выполнить доставку техники</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтмены</name>
      <type>
        <types>CatalogRef.ПричиныЗадержкиВыполненияЭтаповПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>Транспортировка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьАренды</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/Documents/пкОперацииСПультами/ObjectModule.bsl
//#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
///////////////////////////////////////////////////////////////////////
#Область ОбработчикиСобытий
	
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	Документы.пкОперацииСПультами.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	Документы.пкОперацииСПультами.Отразить_пкМестонахожденияПультовДляПодъемников(ДополнительныеСвойства, Движения, Отказ);
	
	СформироватьСписокРегистровДляКонтроля();
	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	//Документы.пкОперацииСПультами.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ВидОперацииВТабличнойЧасти Тогда
		ПроверяемыеРеквизиты.Добавить("ДанныеПоПультам.ВидОперации");
	Иначе
		ПроверяемыеРеквизиты.Добавить("ВидОперации");
	КонецЕсли;
	ПроверяемыеРеквизиты.Добавить("ДанныеПоПультам.Пульт");
		
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	//ПроверитьУстановитьОрганизациюПоТС();
	//
	//Если ЗначениеЗаполнено(НачалоРейсаПлан) И Не ЗначениеЗаполнено(ОкончаниеРейсаПлан) Тогда
	//	ОкончаниеРейсаПлан = КонецДня(НачалоРейсаПлан);
	//КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	СформироватьСписокРегистровДляКонтроля();
	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ВидОперацииВТабличнойЧасти И Не ЗначениеЗаполнено(ВидОперации) Тогда
		Отказ = Истина;
		Возврат; 
	КонецЕсли;
	
	Если ВидОперацииВТабличнойЧасти Тогда
		Для Каждого ТекСтрока Из ДанныеПоПультам Цикл
			Если Не ЗначениеЗаполнено(ТекСтрока.ВидОперации) Тогда
				Отказ = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Отказ Тогда
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#Область ИнициализацияИЗаполнение

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	//Организация		= ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	Подразделение	= ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Пользователи.ТекущийПользователь());
	Ответственный	= Пользователи.ТекущийПользователь();
	//Автор 			= Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти
#Область Прочее

Процедура СформироватьСписокРегистровДляКонтроля()
	
	Массив = Новый Массив;
	
	Массив.Добавить(Движения.пкМестонахожденияПультовДляПодъемников);
	//Массив.Добавить(Движения.пкТехникаКПеремещениюМеждуРегионами);
	
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.пкДоставка") Тогда
		СтандартнаяОбработка = Ложь;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	пкДоставкаЗаданияНаПеревозку.ЗаданиеНаПеревозку.Модель,
		|	пкДоставкаЗаданияНаПеревозку.ЗаданиеНаПеревозку.Техника КАК Техника,
		|	пкДоставкаЗаданияНаПеревозку.ЗаданиеНаПеревозку.ЗаявкаНаАрендуТехники.Партнер КАК Партнер,
		|	пкДоставкаЗаданияНаПеревозку.ЗаданиеНаПеревозку.ЗаявкаНаАрендуТехники.ОбъектСтроительства КАК ОбъектСтроительства,
		|	ВЫБОР КОГДА пкДоставкаЗаданияНаПеревозку.ЗаданиеНаПеревозку.ВидОперации = ЗНАЧЕНИЕ(Перечисление.пкВидыОперацийЗаданийНаПеревозку.ДоставкаКлиенту) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ДоставкаКлиенту,
//rarus+ saveld 07.12.2016 Если в Доставке есть разнонаправленные движения (доставка контрагенту и возврат), то Операция с пультами создается с видом операции в табличной части		
		|	пкДоставкаЗаданияНаПеревозку.ЗаданиеНаПеревозку.СкладПолучатель КАК СкладПолучатель,
		|	ВЫБОР КОГДА пкДоставкаЗаданияНаПеревозку.ЗаданиеНаПеревозку.ВидОперации = ЗНАЧЕНИЕ(Перечисление.пкВидыОперацийЗаданийНаПеревозку.Перекат) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК Перекат,
		|	ВЫБОР КОГДА пкДоставкаЗаданияНаПеревозку.ЗаданиеНаПеревозку.ВидОперации = ЗНАЧЕНИЕ(Перечисление.пкВидыОперацийЗаданийНаПеревозку.ПеремещениеМеждуРегионами) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ПеремещениеМеждуРегионами,
//rarus- saveld 07.12.2016
		|	ВЫБОР КОГДА пкДоставкаЗаданияНаПеревозку.ЗаданиеНаПеревозку.ВидОперации = ЗНАЧЕНИЕ(Перечисление.пкВидыОперацийЗаданийНаПеревозку.ВозвратОтКлиента) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ВозвратОтКлиента
		|ИЗ
		|	Документ.пкДоставка.ЗаданияНаПеревозку КАК пкДоставкаЗаданияНаПеревозку
		|ГДЕ
		|	пкДоставкаЗаданияНаПеревозку.Ссылка = &Ссылка";
	
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
		РезультатЗапроса = Запрос.Выполнить();
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
//rarus+ saveld 07.12.2016 Если в Доставке есть разнонаправленные движения (доставка контрагенту и возврат), то Операция с пультами создается с видом операции в табличной части		
		//ПерваяСтрока = Истина;
		//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//	Если ПерваяСтрока Тогда
		//		Если ВыборкаДетальныеЗаписи.ДоставкаКлиенту Тогда
		//			ВидОперации = Перечисления.пкВидыОперацийСПультами.ПередачаКонтрагенту;
		//			ДокументОснование = ДанныеЗаполнения;
		//			ПерваяСтрока = Ложь;
		//		ИначеЕсли ВыборкаДетальныеЗаписи.ВозвратОтКлиента Тогда
		//			ВидОперации = Перечисления.пкВидыОперацийСПультами.ВозвратОтКонтрагента;
		//			ДокументОснование = ДанныеЗаполнения;
		//			ПерваяСтрока = Ложь;
		//		Иначе	
		//			Продолжить;	
		//		КонецЕсли;	
		//	КонецЕсли;	
		//	Если ВыборкаДетальныеЗаписи.ДоставкаКлиенту И ВидОперации = Перечисления.пкВидыОперацийСПультами.ПередачаКонтрагенту Тогда
		//		НоваяСтрока = ДанныеПоПультам.Добавить();
		//		//НоваяСтрока.Пульт = 
		//		НоваяСтрока.Склад = ВыборкаДетальныеЗаписи.Техника;
		//		НоваяСтрока.Ячейка = ВыборкаДетальныеЗаписи.ОбъектСтроительства;
		//		НоваяСтрока.Партнер = ВыборкаДетальныеЗаписи.Партнер;
		//	ИначеЕсли ВыборкаДетальныеЗаписи.ВозвратОтКлиента И ВидОперации = Перечисления.пкВидыОперацийСПультами.ВозвратОтКонтрагента Тогда
		//		НоваяСтрока = ДанныеПоПультам.Добавить();
		//		//НоваяСтрока.Пульт = 
		//		НоваяСтрока.ОбъектЭксплуатацииВозврат = ВыборкаДетальныеЗаписи.Техника;
		//		НоваяСтрока.ОбъектСтроительстваВозврат = ВыборкаДетальныеЗаписи.ОбъектСтроительства;
		//		НоваяСтрока.Партнер = ВыборкаДетальныеЗаписи.Партнер;
		//	КонецЕсли;	
		//КонецЦикла;

		ДокументОснование = ДанныеЗаполнения;
		ТекВидОперации = Неопределено;
		ВидОперацииВСтроке = Ложь;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.ДоставкаКлиенту Тогда
				НоваяСтрока = ДанныеПоПультам.Добавить();
				//НоваяСтрока.Пульт = 
				НоваяСтрока.Склад = ВыборкаДетальныеЗаписи.Техника;
				НоваяСтрока.Ячейка = ВыборкаДетальныеЗаписи.ОбъектСтроительства;
				НоваяСтрока.Партнер = ВыборкаДетальныеЗаписи.Партнер;
				НоваяСтрока.ВидОперации = Перечисления.пкВидыОперацийСПультами.ПередачаКонтрагенту;
				Если ТекВидОперации = Неопределено Тогда
					ТекВидОперации = НоваяСтрока.ВидОперации;
				ИначеЕсли ТекВидОперации <> НоваяСтрока.ВидОперации Тогда
					ВидОперацииВСтроке = Истина;
				КонецЕсли;	
			ИначеЕсли ВыборкаДетальныеЗаписи.ВозвратОтКлиента Тогда
				НоваяСтрока = ДанныеПоПультам.Добавить();
				//НоваяСтрока.Пульт = 
				НоваяСтрока.ОбъектЭксплуатацииВозврат = ВыборкаДетальныеЗаписи.Техника;
				НоваяСтрока.ОбъектСтроительстваВозврат = ВыборкаДетальныеЗаписи.ОбъектСтроительства;
				НоваяСтрока.Партнер = ВыборкаДетальныеЗаписи.Партнер;
				НоваяСтрока.Склад = ВыборкаДетальныеЗаписи.СкладПолучатель;
				НоваяСтрока.ВидОперации = Перечисления.пкВидыОперацийСПультами.ВозвратОтКонтрагента;
				Если ТекВидОперации = Неопределено Тогда
					ТекВидОперации = НоваяСтрока.ВидОперации;
				ИначеЕсли ТекВидОперации <> НоваяСтрока.ВидОперации Тогда
					ВидОперацииВСтроке = Истина;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
		Если ДанныеПоПультам.Количество() > 0 Тогда
			Если ВидОперацииВСтроке Тогда
				ВидОперацииВТабличнойЧасти = Истина;
			Иначе
				ВидОперацииВТабличнойЧасти = Ложь;
				ВидОперации = ТекВидОперации;
			КонецЕсли;	
		КонецЕсли;
		ИнициализироватьДокумент();
//rarus- saveld 07.12.2016
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
#КонецОбласти

//#КонецЕсли
